Repository: sdv43/whaler
Catalog: po/*.po
Languages: it

source: Manage your Docker containers
it: Gestisci i tuoi contenitori Docker

source: Docker;Virtualizaton;Development;
it: Docker;Virtualizzazione;Sviluppo;

source: Docker Container Management
it: Gestione dei container Docker

source: Whaler provides basic functionality for managing Docker containers. The app can start and stop both standalone containers and docker-compose applications. Also, it supports viewing container logs.
it: Whaler fornisce funzionalità di base per la gestione dei container Docker. L'app può avviare e interrompere sia i contenitori standalone che le applicazioni docker-compose. Inoltre, supporta la visualizzazione dei registri del container.

source: The solution is perfect for those who are looking for a simple tool to perform some basic actions. For the app to run correctly, make sure that Docker is installed on your system.
it: La soluzione è perfetta per chi cerca un semplice strumento per eseguire alcune azioni di base. Affinché l'app funzioni correttamente, assicurati che Docker e docker-compose siano installati sul tuo sistema.

source: Name
it: Nome

source: Type
it: Tipo

source: Back
it: Indietro

source: Update docker container list
it: Aggiorna elenco docker container

source: It looks like Docker requires root rights to use it. Thus, the application cannot connect to Docker Engine API. Find out how to run docker without root rights in <a href="https://docs.docker.com/engine/install/linux-postinstall/">Docker Manuals</a>, otherwise the application cannot work correctly. Or check your socket path to Docker API in Settings.
it: Sembra che Docker richieda i diritti di root per usarlo. Quindi, l'applicazione non potrà connettersi all'API Docker Engine. Scopri come eseguire Docker senza i diritti di root in <a href="https://docs.docker.com/engine/install/linux-postinstall/">Manuali Docker</a>, altrimenti l'applicazione non può funzionare correttamente. Oppure controlla il percorso del tuo socket per l'API Docker in Impostazioni.

source: It looks like Docker is not installed on your system. To find out how to install it, see <a href="https://docs.docker.com/engine/install/">Docker Manuals</a>. Or check your socket path to Docker API in Settings.
it: Sembra che Docker non sia installato sul tuo sistema. Per scoprire come installarlo, vedere <a href="https://docs.docker.com/engine/install/">Manuali Docker</a>. Oppure controlla il percorso del tuo socket per l'API Docker in Impostazioni.

source: The app cannot connect to Docker API
it: L'app non può connettersi all'API Docker

source: Autoscroll
it: Scorrimento automatico

source: Enable autoscroll to bottom border
it: Abilita lo scorrimento automatico fino al bordo inferiore

source: Start
it: Avvia

source: Stop
it: Ferma

source: Unpause
it: Riattiva

source: Pause
it: Pausa

source: Container pause error
it: Errore di pausa del container

source: Restart
it: Riavvia

source: Container restart error
it: Errore di riavvio del container

source: Restarting container
it: Container in riavvio

source: Remove
it: Rimuovi

source: Do you really want to remove container?
it: Vuoi davvero rimuovere il container

source: Yes, remove
it: Sì, rimuovi

source: Cancel
it: Cancella

source: Container remove error
it: Errore di rimozione del container

source: Removing container
it: Rimozione del container

source: Info
it: Informazioni

source: Cannot get information
it: Impossibile ottenere informazioni

source: Container action error
it: Errore di azione del container

source: Container stop error
it: Errore di arresto del container

source: Stopping container
it: Arresto del container

source: Container start error
it: Errore di avvio del container

source: Starting container
it: Container in avvio

source: Container unpause error
it: Errore di ripristino del container

source: Container state is unknown
it: Lo stato del container è sconosciuto

source: No containers
it: Nessun container

source: Sort by:
it: Ordina per:
